CSI API ETABS v1
cGroup Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cGroup
Public Interface cGroup
Dim instance As cGroup
public interface class cGroup
type cGroup =  interface end
The cGroup type exposes the following members.
Methods
Name | Description
Count
 Retrieves the number of defined groups.
Delete
 Deletes the specified group.
GetAssignments
 Retrieves the assignments to a specified group
GetGroup
 Retrieves the group data.
GetGroup_1
 Retrieves the group data. Primarily for ETABS
GetNameList
SetGroup
 Sets the group data.
SetGroup_1
 Sets the group data. Primarily for ETABS
Top
See Also
Reference
ETABSv1 Namespace